park_place/app/views/pages/map.html.erb

    %>
<% Park.all.each do |p|
---
SELECT `parks`.* FROM `parks`


<% Favourite.all.each do |f|
---
SELECT `favourites`.* FROM `favourites`