park_place/app/controllers/application_controller.rb

SELECT  `favourites`.* FROM `favourites` WHERE (uid = NULL and park_id = '234')  ORDER BY `favourites`.`id` ASC LIMIT 1
INSERT INTO `favourites` (`uid`, `park_id`, `created_at`, `updated_at`) VALUES ('', 234, '2015-07-15 00:55:23', '2015-07-15 00:55:23')
DELETE FROM `favourites` WHERE `favourites`.`id` = 158
---
    def changeFavourite
        parkID = params[:parkID]
        userID = params[:userID]
        if (Favourite.where(["uid = ? and park_id = ?", userID, parkID]).first == nil)
            Favourite.create(:uid => userID.to_s, :park_id => parkID.to_i)

         else
            Favourite.where(["uid = ? and park_id = ?", userID, parkID]).first.delete