park_place/app/controllers/pages_controller.rb

	 def map
         @parks=Park.all
         parkIdHash = Hash.new
         userIdHash = Hash.new
         i = 0
         Favourite.all.each do |fav|
---
SELECT `parks`.* FROM `parks`
SELECT `favourites`.* FROM `favourites`